#!/usr/bin/python3
# -*- coding: utf-8 -*-

notimpl_str = """@{} 待开发"""
eeequit_str = """@{} 欢迎再次光临"""
inner_error_str = """@{} 三眼天机内部错误"""
input_code_or_name = """@{} 输入股票码或名字:"""
stock_info_str = """@{} 查询信息如下:     
    {} 
    """

welcome_str = """@{} 三眼天机为你服务:
    1. 系统设置
    2. 实时监控
    3. 查询股票
    9. 退出"""

system_set_str = """@{} 系统设置:      
    1. 三眼天机自升级
    2. 启动/停止
    3. 监控时间秒数
    9. 退出"""

monitor_str = """@{} 实时监控:       
    1. 添加股票(代码或名称)
    2. 删除股票(代码或名称)
    3. 显示已监控的股票
    4. 显示当前监控策略
    9. 退出"""

query_str = """@{} 查询股票:         
    1. 获取简要信息
    2. 获取最新行情
    3. 获取实时资金流向
    4. 获取盘口分析
    9. 退出"""
